from django.db import models
HadithsNarrator=[
    ('البخاري','البخاري'),
    ('مسلم','مسلم'),
    ('الترمذي','الترمذي'),
    
     ('النسائي','النسائي'),
    ('أبي داود','أبي داود'),
    ('ابن ماجه','ابن ماجه'),
]
HadithsType=[
    ('حسن','حسن'),('صحيح','صحيح'),('ضعيف','ضعيف'),('معلق','معلق'),('منقطع','منقطع'),('معضل','معضل'),
    ('المُرسَل','المُرسَل'),('مرسل الصحابي','مرسل الصحابي'),('المدلس','المدلس'),('الموضوع','الموضوع'),
    ('المتروك','المتروك'),('المنكر','المنكر'),('المطروح','المطروح'),('المضعف','المضعف'), ('المجهول','المجهول'),
    ('المدرج','المدرج'),('المقلوب','المقلوب'),('المُضطرِب','المُضطرِب'),('المصحف والمحرف','المصحف والمحرف'),
    ('الشاذ','الشاذ'),('المعلل','المعلل'),('المرفوع','المرفوع'),('الموقوف','الموقوف'),('المقطوع','المقطوع'),
    ('المتواتر','المتواتر'),('خبر الآحاد','خبر الآحاد'),('المُسنَد','المُسنَد'),('المتصل','المتصل'),('المسلسل','المسلسل'),
    ('الاعتبار','الاعتبار'),('حديث الفرد','حديث الفرد'),(' المعنعن',' المعنعن'),(' المؤنن',' المؤنن'),(' المنقلب',' المنقلب'),
    (' العالي',' العالي'),(' النازل',' النازل'),(' الغريب',' الغريب'),(' المبهم',' المبهم'),(' المدبج',' المدبج'),
    (' الناسخ والمنسوخ',' الناسخ والمنسوخ'),(' المؤتلف والمختلف',' المؤتلف والمختلف'),      
]

class Hadith (models.Model):
    narrator=models.CharField(max_length=250,choices=HadithsNarrator)
    text=models.TextField(max_length=5000)
    explantion=models.TextField(max_length=5000,blank=True)
    hadithstype=models.CharField(max_length=250,choices=HadithsType)
